<?php 
include "connect.php";

// بداية الجلسة
session_start();

// فحص ما إذا كان المتغيرين معرفين في جلسة العمل
if(isset($_SESSION['user_type']) && isset($_SESSION['email'])) {
    // المتغيران معرفان في الجلسة، يمكن الاستمرار في تشغيل الكود
    // إلغاء جلسة العمل بأكملها
    session_unset();
    // إنهاء الجلسة
    session_destroy();
    
    // إعادة توجيه المستخدم إلى صفحة تسجيل الدخول
    header("location: index.php");
    exit(); // توقف تنفيذ البرنامج بعد إعادة التوجيه
} else {
    // في حالة عدم وجود جلسة نشطة أو عدم تعيين المتغيرين، قم بتوجيه المستخدم إلى صفحة تسجيل الدخول
    header("location: index.php");
    exit(); // توقف تنفيذ البرنامج بعد إعادة التوجيه
}
?>
